hebertreis/taptosow/esp8266-arduino/src/main.cpp
/**
 * OneTapGo - ESP8266 NFC Writer with MQTT Integration
 * Hardware: NodeMCU LoLin V3 (HW 364-A) with RC522 NFC Reader and LCD Display
 * 
 * Features:
 * - WiFi Manager for hotspot configuration
 * - MQTT over TLS for secure communication
 * - LCD display for operator feedback
 * - OTA updates support
 * - Watchdog handling
 * - Production-ready error handling and reconnection logic
 * - Debug mode for detailed NFC tag information
 * - Read mode for reading and sending tag data
 *
 * MQTT Topics:
 * - onetapgo/{deviceId}/status      - Device status updates
 * - onetapgo/{deviceId}/heartbeat   - Heartbeat messages
 * - onetapgo/{deviceId}/command     - Commands from admin
 * - onetapgo/{deviceId}/result      - Write results and tag data
 * - onetapgo/{deviceId}/debug       - Debug and mode status
 *
 * MQTT Commands (send to /command topic):
 * - write_tag: { "type": "write_tag", "tenantId": "xxx", "sectorId": "yyy", "url": "https://..." }
 * - set_debug: { "type": "set_debug", "enabled": true/false }
 * - set_read_mode: { "type": "set_read_mode", "enabled": true/false }
 * - read_tag: { "type": "read_tag" }  // One-time read
 * - status: { "type": "status" }      // Request current status
 * - restart: { "type": "restart" }    // Restart device
 *
 * @version 3.1.0
 * @author OneTapGo by CRE8 Tecnologia
 */

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <PubSubClient.h>
#include <ESP8266HTTPClient.h>
#include <WiFiManager.h>
#include <ArduinoJson.h>
#include <SPI.h>
#include <NdefMessage.h>
#include <NfcAdapter.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

// ============================================================================
// CONFIGURATION - Update these values for your deployment
// ============================================================================

// MQTT Configuration
#define MQTT_HOST "m191dfff.ala.us-east-1.emqxsl.com"
#define MQTT_PORT 8883
#define MQTT_USERNAME "onetapgo"
#define MQTT_PASSWORD "onetapgo"
#define MQTT_USE_TLS true
#define MQTT_CLIENT_PREFIX "onetapgo_device"

// Device Configuration
#define DEVICE_VERSION "3.2.0"
#define HEARTBEAT_INTERVAL 30000      // 30 seconds
#define WIFI_RECONNECT_INTERVAL 10000 // 10 seconds
#define MQTT_RECONNECT_DELAY 5000     // 5 seconds
#define MAX_RECONNECT_ATTEMPTS 10

// NFC Optimization Configuration
#define NFC_POLL_INTERVAL 50          // 50ms between NFC polls (faster detection)
#define NFC_ACTIVITY_TIMEOUT 5000     // 5 seconds timeout for NFC operations
#define SECTOR_COUNT 16               // Number of sectors to read (for 1K cards)

// Hardware Configuration - NodeMCU LoLin V3 (HW-364A)
// OLED is fixed on board using I2C on GPIO14/12 (D5/D6)
// RC522 must use Software SPI on different pins to avoid conflict
#define RC522_SS_PIN  15  // D8 (GPIO 15) - SS/CS
#define RC522_RST_PIN 0   // D3 (GPIO 0) - RST

// Software SPI pins for RC522 (to avoid conflict with OLED on GPIO14/12)
#define RC522_SCK_PIN 5   // D1 (GPIO 5) - SCK
#define RC522_MISO_PIN 4  // D2 (GPIO 4) - MISO  
#define RC522_MOSI_PIN 13 // D7 (GPIO 13) - MOSI

// LCD Display Configuration (SSD1306 128x64) - Fixed on HW-364A
// DO NOT CHANGE: These are the hardware I2C pins for the onboard OLED
#define OLED_SDA_PIN 14   // D5 (GPIO 14) - I2C SDA (fixed on HW-364A)
#define OLED_SCL_PIN 12   // D6 (GPIO 12) - I2C SCL (fixed on HW-364A)
#define OLED_RESET_PIN -1 // RST (GPIO 16)
#define OLED_ADDRESS 0x3C

// Button Configuration (optional)
#define BUTTON_PIN 0      // D3 (GPIO 0) - Optional button for manual trigger

// ============================================================================
// GLOBAL VARIABLES
// ============================================================================

// Hardware instances
ESP8266WiFiMulti wifiMulti;
WiFiClientSecure wifiClient;
PubSubClient mqttClient;
// MFRC522 with standard constructor - will configure Software SPI pins in nfcInit()
MFRC522 mfrc522(RC522_SS_PIN, RC522_RST_PIN);
NfcAdapter nfc = NfcAdapter(&mfrc522);
Adafruit_SSD1306 display(128, 64, &Wire, OLED_RESET_PIN);

// State variables
String deviceId = "";
String mqttTopicBase = "";
bool isMqttConnected = false;
bool isWifiConnected = false;
bool isNfcConnected = false;
byte nfcFirmwareVersion = 0x00;
unsigned long lastHeartbeat = 0;
unsigned long lastReconnectAttempt = 0;
int reconnectAttempts = 0;
unsigned long lastActivityTime = 0;

// Working state
enum DeviceState {
    STATE_IDLE,
    STATE_WAITING_TAG,
    STATE_TAG_DETECTED,
    STATE_WRITING,
    STATE_SUCCESS,
    STATE_ERROR,
    STATE_CONFIG_MODE,
    STATE_READ_MODE
};

DeviceState currentState = STATE_IDLE;
String pendingTenantId = "";
String pendingSectorId = "";
String pendingUrl = "";
bool debugMode = false;
bool readMode = true;  // Default to read mode (always transmitting to MQTT)
bool hasPendingWriteCommand = false;  // True when waiting for write command from MQTT

// ============================================================================
// SOFTWARE SPI FOR RC522 (to avoid conflict with OLED on GPIO14/12)
// ============================================================================

// Software SPI pin definitions
#define SOFT_SPI_SCK_PIN  5   // D1 (GPIO 5)
#define SOFT_SPI_MISO_PIN 4   // D2 (GPIO 4)
#define SOFT_SPI_MOSI_PIN 13  // D7 (GPIO 13)

// Write a byte to RC522 using Software SPI
void softSpiWrite(byte data) {
    for (int i = 7; i >= 0; i--) {
        digitalWrite(SOFT_SPI_SCK_PIN, LOW);
        digitalWrite(SOFT_SPI_MOSI_PIN, (data >> i) & 0x01);
        digitalWrite(SOFT_SPI_SCK_PIN, HIGH);
    }
}

// Read a byte from RC522 using Software SPI
byte softSpiRead() {
    byte data = 0;
    pinMode(SOFT_SPI_MISO_PIN, INPUT);
    for (int i = 7; i >= 0; i--) {
        digitalWrite(SOFT_SPI_SCK_PIN, LOW);
        if (digitalRead(SOFT_SPI_MISO_PIN)) {
            data |= (1 << i);
        }
        digitalWrite(SOFT_SPI_SCK_PIN, HIGH);
    }
    return data;
}

// Transfer a byte to/from RC522 using Software SPI
byte softSpiTransfer(byte data) {
    softSpiWrite(data);
    return softSpiRead();
}

// Initialize Software SPI pins
void softSpiBegin() {
    pinMode(SOFT_SPI_SCK_PIN, OUTPUT);
    pinMode(SOFT_SPI_MOSI_PIN, OUTPUT);
    pinMode(SOFT_SPI_MISO_PIN, INPUT);
    digitalWrite(SOFT_SPI_SCK_PIN, LOW);
}

// Forward declarations
void publishStatus();
void publishHeartbeat();
void publishDebugStatus();
void publishReadModeStatus();
void publishTagData(const String& tagId, const String& ndefUrl = "");
String readTagData();
String readAllSectorData();
String extractNdefUrl();
void waitForTagRemoval();

// ============================================================================
// LCD DISPLAY FUNCTIONS
// ============================================================================

