hebertreis/taptosow/esp8266-arduino/src/main.cpp
void displayInit() {
    Wire.begin(OLED_SDA_PIN, OLED_SCL_PIN);

    if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_ADDRESS)) {
        Serial.println(F("SSD1306 allocation failed"));
        return;
    }

    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(0, 0);
    display.println(F("OneTapGo v" DEVICE_VERSION));
    display.println(F("Initializing..."));
    display.display();
    delay(500); // Reduced from 1000ms
}

void displayShowState(DeviceState state, const char* extraInfo = nullptr) {
    display.clearDisplay();

    // --- LINE 0 (y=0): Header bar (yellow area - typically 8-10 pixels) ---
    display.setTextSize(1);
    display.setCursor(0, 0);
    display.print(F("OneTapGo"));
    // Show firmware version right-aligned area (abbreviated)
    display.setCursor(74, 0);
    display.print(F("v" DEVICE_VERSION));

    // Divider line - placed at y=10 to separate header from content
    display.drawLine(0, 10, 127, 10, SSD1306_WHITE);

    // --- LINE 1 (y=12): Mode + state (below yellow area) ---
    display.setCursor(0, 12);
    display.setTextSize(1);
    switch (state) {
        case STATE_IDLE:
            if (!isWifiConnected || !isMqttConnected || !isNfcConnected) {
                display.print(F("[~] Inicializando"));
            } else if (hasPendingWriteCommand) {
                display.print(F("[W] Aguardando tag"));
            } else if (readMode) {
                display.print(F("[R] Lendo tags"));
            } else {
                display.print(F("[S] Standby"));
            }
            break;
        case STATE_WAITING_TAG:
            display.print(F("[W] Aguardando tag..."));
            break;
        case STATE_TAG_DETECTED:
            display.print(F("[*] Tag detectada!"));
            break;
        case STATE_WRITING:
            display.print(F("[W] Gravando NDEF..."));
            break;
        case STATE_SUCCESS:
            display.print(F("[OK] Gravado! Retire"));
            break;
        case STATE_ERROR:
            display.print(F("[!!] Erro!"));
            if (extraInfo) {
                display.setCursor(0, 24);
                display.print(extraInfo);
            }
            break;
        case STATE_CONFIG_MODE:
            display.print(F("[AP] Config WiFi"));
            break;
        case STATE_READ_MODE:
            display.print(F("[R] Lendo tags"));
            break;
    }

    // --- LINE 2 (y=24): WiFi status + SSID (truncated to 10 chars) ---
    display.setCursor(0, 24);
    if (isWifiConnected) {
        display.print(F("W+ "));
        String ssid = WiFi.SSID();
        if (ssid.length() > 10) ssid = ssid.substring(0, 10);
        display.print(ssid);
    } else {
        display.print(F("W- SEM WIFI"));
    }

    // --- LINE 3 (y=36): MQTT + NFC status ---
    display.setCursor(0, 36);
    display.print(F("M"));
    display.print(isMqttConnected ? F("+") : F("-"));
    display.print(F(" NFC"));
    display.print(isNfcConnected ? F("+") : F("-"));

    // --- LINE 4 (y=48): IP Address ---
    display.setCursor(0, 48);
    if (isWifiConnected) {
        display.print(F("IP:"));
        display.print(WiFi.localIP().toString());
    }

    // --- LINE 5 (y=56): RSSI bar when connected ---
    if (isWifiConnected) {
        int rssi = WiFi.RSSI();
        display.setCursor(0, 56);
        display.print(F("dBm:"));
        display.print(rssi);
        // Simple signal bars (4 chars wide)
        int bars = 0;
        if (rssi > -50) bars = 4;
        else if (rssi > -65) bars = 3;
        else if (rssi > -75) bars = 2;
        else if (rssi > -85) bars = 1;
        display.setCursor(68, 56);
        for (int b = 0; b < 4; b++) {
            display.print(b < bars ? F("|") : F("."));
        }
    }

    display.display();
}

void displayShowMessage(const char* title, const char* message, int duration = 2000) {
    display.clearDisplay();
    display.setCursor(0, 0);
    display.setTextSize(1);
    display.println(title);
    display.println();
    display.setTextSize(1);
    display.println(message);
    display.display();
    delay(duration);
}

void displayShowQR(const char* ssid, const char* password) {
    display.clearDisplay();
    display.setCursor(0, 0);
    display.setTextSize(1);
    display.println(F("WiFi Setup"));
    display.println();
    display.print(F("SSID: "));
    display.println(ssid);
    display.print(F("Pass: "));
    display.println(password);
    display.println();
    display.println(F("Connect & configure"));
    display.display();
}

// ============================================================================
// WIFI MANAGEMENT
// ============================================================================

void wifiInit() {
    Serial.println(F("\n[WiFi] Initializing..."));
    
    // Generate device ID from MAC address
    uint8_t mac[6];
    WiFi.macAddress(mac);
    deviceId = String(MQTT_CLIENT_PREFIX) + "_" + 
               String(mac[4], HEX) + 
               String(mac[5], HEX);
    mqttTopicBase = "onetapgo/" + deviceId;
    
    Serial.print(F("[WiFi] Device ID: "));
    Serial.println(deviceId);
    
    // Configure WiFi Manager
    WiFiManager wifiManager;
    
    // Set timeout for configuration portal
    wifiManager.setConfigPortalTimeout(180); // 3 minutes
    
    // Set connection timeout
    wifiManager.setConnectTimeout(60);
    
    // Custom AP SSID
    String apSSID = "OneTapGo_" + deviceId.substring(deviceId.length() - 6);
    
    // Custom AP password
    const char* apPassword = "onetapgo123";

    // WiFi Manager parameters
    WiFiManagerParameter customText("<p style='text-align:center;font-weight:bold;'>OneTapGo NFC Writer</p>");
    wifiManager.addParameter(&customText);

    // Try to connect to saved network, or start configuration portal
    wifiManager.setAPCallback([](WiFiManager* wm) {
        Serial.println(F("[WiFi] Configuration portal started"));
        displayShowQR(wm->getConfigPortalSSID().c_str(), "onetapgo123");
    });
    
