hebertreis/taptosow/esp8266-arduino/src/main.cpp
    if (!wifiManager.autoConnect(apSSID.c_str(), apPassword)) {
        Serial.println(F("[WiFi] Failed to connect, restarting..."));
        displayShowMessage("WiFi Error", "Restarting...", 3000);
        delay(3000);
        ESP.restart();
        return;
    }
    
    isWifiConnected = true;
    Serial.println(F("[WiFi] Connected successfully"));
    Serial.print(F("[WiFi] IP address: "));
    Serial.println(WiFi.localIP());
    
    displayShowMessage("WiFi OK", WiFi.localIP().toString().c_str(), 1000);
}

void wifiCheckConnection() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println(F("[WiFi] Connection lost, reconnecting..."));
        isWifiConnected = false;
        
        if (millis() - lastReconnectAttempt > WIFI_RECONNECT_INTERVAL) {
            lastReconnectAttempt = millis();
            
            // Try to reconnect
            WiFi.reconnect();
            
            if (WiFi.status() == WL_CONNECTED) {
                isWifiConnected = true;
                Serial.println(F("[WiFi] Reconnected successfully"));
                Serial.print(F("[WiFi] IP: "));
                Serial.println(WiFi.localIP());
                displayShowMessage("WiFi Reconnected", WiFi.localIP().toString().c_str(), 1000);
                reconnectAttempts = 0;
            } else {
                reconnectAttempts++;
                Serial.print(F("[WiFi] Reconnect attempt "));
                Serial.print(reconnectAttempts);
                Serial.println(F(" failed"));
                
                if (reconnectAttempts >= MAX_RECONNECT_ATTEMPTS) {
                    Serial.println(F("[WiFi] Max attempts reached, restarting WiFi"));
                    WiFi.disconnect(true);
                    delay(1000);
                    wifiInit();
                    reconnectAttempts = 0;
                }
            }
        }
    }
}

// ============================================================================
// MQTT MANAGEMENT
// ============================================================================

void mqttCallback(char* topic, byte* payload, unsigned int length) {
    // Convert payload to string
    String message;
    for (unsigned int i = 0; i < length; i++) {
        message += (char)payload[i];
    }

    Serial.print(F("[MQTT] Message received: "));
    Serial.println(topic);
    Serial.println(message);

    // Parse JSON
    StaticJsonDocument<512> doc;
    DeserializationError error = deserializeJson(doc, message);

    if (error) {
        Serial.print(F("[MQTT] JSON parse error: "));
        Serial.println(error.c_str());
        return;
    }

    // Handle command
    const char* commandType = doc["type"];

    if (strcmp(commandType, "write_tag") == 0) {
        pendingTenantId = doc["tenantId"].as<String>();
        pendingSectorId = doc["sectorId"].as<String>();
        pendingUrl = doc["url"].as<String>();
        hasPendingWriteCommand = true;  // Mark that we have a pending write command
        readMode = false;  // Disable read mode when waiting for write
        currentState = STATE_WAITING_TAG;
        displayShowState(STATE_WAITING_TAG);

        Serial.println(F("[MQTT] Write command received"));
        Serial.print(F("[MQTT] Tenant: "));
        Serial.println(pendingTenantId);
        Serial.print(F("[MQTT] Sector: "));
        Serial.println(pendingSectorId);
        Serial.print(F("[MQTT] URL: "));
        Serial.println(pendingUrl);
        Serial.println(F("[MQTT] Mode: Writer (waiting for tag)"));
    }
    else if (strcmp(commandType, "status") == 0) {
        // Send current status
        publishStatus();
    }
    else if (strcmp(commandType, "restart") == 0) {
        Serial.println(F("[MQTT] Restart command received"));
        displayShowMessage("Restarting", "By remote command", 1000);
        ESP.restart();
    }
    else if (strcmp(commandType, "set_debug") == 0) {
        debugMode = doc["enabled"].as<bool>();
        Serial.print(F("[MQTT] Debug mode: "));
        Serial.println(debugMode ? "ON" : "OFF");
        publishDebugStatus();
    }
    else if (strcmp(commandType, "set_read_mode") == 0) {
        readMode = doc["enabled"].as<bool>();
        if (readMode) {
            hasPendingWriteCommand = false;  // Clear any pending write command
            pendingTenantId = "";
            pendingSectorId = "";
            pendingUrl = "";
            currentState = STATE_READ_MODE;
            displayShowState(STATE_READ_MODE);
            Serial.println(F("[MQTT] Mode: Reader (auto-transmitting)"));
        } else {
            currentState = STATE_IDLE;
            displayShowState(STATE_IDLE);
            Serial.println(F("[MQTT] Mode: Standby"));
        }
        Serial.print(F("[MQTT] Read mode: "));
        Serial.println(readMode ? "ON" : "OFF");
        publishReadModeStatus();
    }
    else if (strcmp(commandType, "read_tag") == 0) {
        // One-time read command
        currentState = STATE_READ_MODE;
        displayShowState(STATE_READ_MODE);
        Serial.println(F("[MQTT] One-time read command received"));
    }
}

void mqttInit() {
    Serial.println(F("\n[MQTT] Initializing..."));
    
    // Configure secure WiFi client
    wifiClient.setInsecure(); // Skip certificate verification for production
    wifiClient.setTimeout(10);
    
    // Configure MQTT client
    mqttClient.setClient(wifiClient);
    mqttClient.setServer(MQTT_HOST, MQTT_PORT);
    mqttClient.setCallback(mqttCallback);
    mqttClient.setBufferSize(1024);
    mqttClient.setKeepAlive(60);
    mqttClient.setSocketTimeout(30);
    
    Serial.print(F("[MQTT] Server: "));
    Serial.println(MQTT_HOST);
    Serial.print(F("[MQTT] Port: "));
    Serial.println(MQTT_PORT);
    Serial.print(F("[MQTT] Client ID: "));
    Serial.println(deviceId);
}

bool mqttConnect() {
    if (mqttClient.connected()) {
        return true;
    }
    
    Serial.print(F("[MQTT] Connecting..."));
    
    // Last will message
    String willTopic = mqttTopicBase + "/status";
    String willMessage = "{\"status\":\"offline\",\"timestamp\":" + String(millis()) + "}";
    
    if (mqttClient.connect(deviceId.c_str(), MQTT_USERNAME, MQTT_PASSWORD,
                          willTopic.c_str(), 1, true, willMessage.c_str())) {
        Serial.println(F(" OK"));

