hebertreis/taptosow/esp8266-arduino/src/main.cpp
        // Subscribe to command topic
        String commandTopic = mqttTopicBase + "/command";
        mqttClient.subscribe(commandTopic.c_str(), 1);
        Serial.print(F("[MQTT] Subscribed to: "));
        Serial.println(commandTopic);

        isMqttConnected = true;
        publishStatus();
        
        // Update display to show MQTT connected
        displayShowState(currentState);

        return true;
    } else {
        Serial.print(F(" FAILED - Code: "));
        Serial.println(mqttClient.state());
        isMqttConnected = false;
        return false;
    }
}

void mqttLoop() {
    mqttClient.loop();

    // Check connection - update display if status changed
    static bool wasConnected = false;
    bool currentlyConnected = mqttClient.connected();
    
    if (!currentlyConnected) {
        // Connection lost - update display if status changed
        if (wasConnected && isMqttConnected) {
            isMqttConnected = false;
            displayShowState(currentState);
        }
        
        if (millis() - lastReconnectAttempt > MQTT_RECONNECT_DELAY) {
            lastReconnectAttempt = millis();

            bool connected = mqttConnect();
            if (!connected) {
                reconnectAttempts++;
                Serial.print(F("[MQTT] Reconnect attempt "));
                Serial.print(reconnectAttempts);
                Serial.println(F(" failed"));

                if (reconnectAttempts >= MAX_RECONNECT_ATTEMPTS) {
                    Serial.println(F("[MQTT] Max attempts reached"));
                    reconnectAttempts = 0;
                }
            } else {
                // Successfully reconnected - update display
                displayShowState(currentState);
            }
        }
    } else {
        // Is connected
        wasConnected = true;
    }

    // Send heartbeat
    if (millis() - lastHeartbeat > HEARTBEAT_INTERVAL) {
        lastHeartbeat = millis();
        publishHeartbeat();
    }
}

void publishMessage(const String& topic, const String& payload, bool retained = false) {
    if (!isMqttConnected) {
        Serial.println(F("[MQTT] Cannot publish - not connected"));
        return;
    }
    
    if (mqttClient.publish(topic.c_str(), payload.c_str(), retained)) {
        Serial.print(F("[MQTT] Published to "));
        Serial.print(topic);
        Serial.print(F(": "));
        Serial.println(payload);
    } else {
        Serial.print(F("[MQTT] Publish failed to "));
        Serial.println(topic);
    }
}

void publishStatus() {
    StaticJsonDocument<512> doc;
    doc["status"] = isMqttConnected ? "online" : "offline";
    // Device is only "ready" if all systems are connected
    doc["ready"] = (isWifiConnected && isMqttConnected && isNfcConnected);
    doc["state"] = currentState;
    doc["connections"] = JsonObject();
    doc["connections"]["wifi"] = isWifiConnected;
    doc["connections"]["mqtt"] = isMqttConnected;
    doc["connections"]["nfc"] = isNfcConnected;
    doc["operationMode"] = hasPendingWriteCommand ? "writer" : (readMode ? "reader" : "standby");
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["wifi_ssid"] = WiFi.SSID();
    doc["ip_address"] = WiFi.localIP().toString();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["timestamp"] = millis();
    doc["version"] = DEVICE_VERSION;
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;
    doc["hasPendingCommand"] = hasPendingWriteCommand;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/status", payload);
}

void publishHeartbeat() {
    StaticJsonDocument<512> doc;
    doc["type"] = "heartbeat";
    doc["deviceId"] = deviceId;
    doc["state"] = currentState;
    // Device is only "ready" if all systems are connected
    doc["ready"] = (isWifiConnected && isMqttConnected && isNfcConnected);
    doc["connections"] = JsonObject();
    doc["connections"]["wifi"] = isWifiConnected;
    doc["connections"]["mqtt"] = isMqttConnected;
    doc["connections"]["nfc"] = isNfcConnected;
    doc["operationMode"] = hasPendingWriteCommand ? "writer" : (readMode ? "reader" : "standby");
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["uptime"] = millis();
    doc["timestamp"] = millis();
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;
    doc["hasPendingCommand"] = hasPendingWriteCommand;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/heartbeat", payload);
}

void publishTagDetected(const String& tagId) {
    StaticJsonDocument<256> doc;
    doc["type"] = "tag_detected";
    doc["deviceId"] = deviceId;
    doc["tagId"] = tagId;
    doc["timestamp"] = millis();
    
    String payload;
    serializeJson(doc, payload);
    
    publishMessage(mqttTopicBase + "/result", payload);
}

void publishWriteResult(bool success, const String& error = "") {
    StaticJsonDocument<256> doc;
    doc["type"] = success ? "write_success" : "write_error";
    doc["deviceId"] = deviceId;
    doc["success"] = success;
    if (!success) {
        doc["error"] = error;
    }
    if (success && error.length() > 0) {
        doc["url"] = error; // Reuse error parameter for URL on success
        doc["error"] = "";
    }
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/result", payload);
}

void publishDebugStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "debug_status";
    doc["deviceId"] = deviceId;
    doc["debugEnabled"] = debugMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishReadModeStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "read_mode_status";
    doc["deviceId"] = deviceId;
    doc["readModeEnabled"] = readMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

// ============================================================================
// NFC TAG DATA READ
// ============================================================================

void publishTagData(const String& tagId, const String& ndefUrl) {
    StaticJsonDocument<1024> doc;
    doc["type"] = "tag_data";
    doc["deviceId"] = deviceId;
    doc["serialNumber"] = tagId;  // NFC serial number (UID)
    doc["timestamp"] = millis();

    // NDEF section
    JsonObject ndef = doc.createNestedObject("ndef");

    // Try to read NDEF message for rich data
    NfcTag tag = nfc.read();
    if (tag.hasNdefMessage()) {
        NdefMessage message = tag.getNdefMessage();
        ndef["hasMessage"] = true;
        ndef["recordCount"] = message.getRecordCount();

        JsonArray records = ndef.createNestedArray("records");
        for (int i = 0; i < message.getRecordCount(); i++) {
            NdefRecord record = message.getRecord(i);
            JsonObject recObj = records.createNestedObject();

            // Record type (TNF + type bytes)
            byte tnf = record.getTnf();
            recObj["tnf"] = tnf;

            // Type as string
            String typeStr = "";
            byte typeLen = record.getTypeLength();
            for (byte j = 0; j < typeLen; j++) {
                char c = record.getType()[j];
                if (c >= 32 && c < 127) typeStr += c;
            }
            recObj["type"] = typeStr;

            // Detect record kind
            if (tnf == 0x01 && typeLen == 1 && record.getType()[0] == 0x55) {
                // URI record
                recObj["kind"] = "URI";
                uint16_t payloadLen = record.getPayloadLength();
                if (payloadLen > 1) {
                    byte prefixCode = record.getPayload()[0];
                    String prefix = "";
                    switch(prefixCode) {
                        case 0x01: prefix = "http://www."; break;
                        case 0x02: prefix = "https://www."; break;
                        case 0x03: prefix = "http://"; break;
                        case 0x04: prefix = "https://"; break;
                        default: prefix = ""; break;
                    }
                    String uriPayload = prefix;
                    for (uint16_t j = 1; j < payloadLen; j++) {
                        char c = record.getPayload()[j];
                        if (c >= 32 && c < 127) uriPayload += c;
                    }
                    recObj["payload"] = uriPayload;
                    // Set top-level ndefUrl from first URI record
                    if (i == 0) doc["ndefUrl"] = uriPayload;
                }
            } else if (tnf == 0x01 && typeLen == 1 && record.getType()[0] == 0x54) {
                // Text record
                recObj["kind"] = "TEXT";
                String textPayload = "";
                uint16_t payloadLen = record.getPayloadLength();
                // First byte: language code length
                if (payloadLen > 0) {
                    byte langLen = record.getPayload()[0] & 0x3F;
                    for (uint16_t j = 1 + langLen; j < payloadLen; j++) {
                        char c = record.getPayload()[j];
                        if (c >= 32 && c < 127) textPayload += c;
                    }
                }
                recObj["payload"] = textPayload;
            } else {
                // Generic record - raw payload as printable
                recObj["kind"] = "UNKNOWN";
                String rawPayload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen && j < 32; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) rawPayload += c;
                    else rawPayload += '.';
                }
                recObj["payload"] = rawPayload;
            }
        }
    } else {
        ndef["hasMessage"] = false;
        // If we already extracted URL before calling this function, include it
        if (ndefUrl.length() > 0) {
            doc["ndefUrl"] = ndefUrl;
        }
    }

    // Debug: read sector data if enabled
    if (debugMode) {
        String sectorData = readAllSectorData();
        if (sectorData.length() > 0) {
            doc["sectorData"] = sectorData;
        }
    }

    Serial.print(F("[NFC] Publishing tag data - UID: "));
    Serial.println(tagId);

    String payload;
    serializeJson(doc, payload);
    publishMessage(mqttTopicBase + "/result", payload);
}



String generateOneTapGoUrl(const String& tenantId, const String& sectorId) {
    // Generate URL based on tenant and sector
    // Format: https://onetapgo.site/a/{uniqueId}
    // The uniqueId should be generated and stored in Firestore
    
    // For now, use a combination of device ID and timestamp
    String uniqueId = deviceId + "_" + String(millis());
    return "https://onetapgo.site/a/" + uniqueId;
}

