hebertreis/taptosow/esp8266-arduino/src/main.cpp
            Serial.print(F("[NFC] Tag type: "));
            Serial.println(mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak));

            mfrc522.PICC_HaltA();
        }

        // Try to read NDEF data
        Serial.println(F("[NFC] Attempting to read NDEF data..."));
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            Serial.print(F("[NFC] NDEF records: "));
            Serial.println(message.getRecordCount());

            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                Serial.print(F("[NFC] Record "));
                Serial.print(i);
                Serial.print(F(" Type: "));

                // Print type as hex bytes
                byte typeLen = record.getTypeLength();
                for (byte j = 0; j < typeLen; j++) {
                    byte b = record.getType()[j];
                    if (b < 0x10) Serial.print(F("0"));
                    Serial.print(b, HEX);
                    Serial.print(F(" "));
                }
                Serial.println();

                String payload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payload += c;
                }
                Serial.print(F("[NFC] Payload: "));
                Serial.println(payload);
            }
        } else {
            Serial.println(F("[NFC] No NDEF data or read failed"));
        }

        Serial.println(F("[NFC] ========================"));
    }

    return tagId;
}

String extractNdefUrl() {
    String url = "";
    
    // Try to read NDEF message
    NfcTag tag = nfc.read();
    if (!tag.hasNdefMessage()) {
        Serial.println(F("[NFC] No NDEF message found"));
        return "";
    }
    
    NdefMessage message = tag.getNdefMessage();
    int recordCount = message.getRecordCount();
    
    for (int i = 0; i < recordCount; i++) {
        NdefRecord record = message.getRecord(i);
        
        // Check if it's a URI record (type "U" or 0x55)
        byte typeLen = record.getTypeLength();
        if (typeLen == 1 && record.getType()[0] == 0x55) {
            // URI record found
            uint16_t payloadLen = record.getPayloadLength();
            if (payloadLen > 1) {
                byte prefixCode = record.getPayload()[0];
                
                // Get prefix based on code
                String prefix = "";
                if (prefixCode == 0x00) prefix = "";
                else if (prefixCode == 0x01) prefix = "http://www.";
                else if (prefixCode == 0x02) prefix = "https://www.";
                else if (prefixCode == 0x03) prefix = "http://";
                else if (prefixCode == 0x04) prefix = "https://";
                else prefix = "";
                
                // Read the rest of the payload
                for (uint16_t j = 1; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) {
                        url += c;
                    }
                }
                
                // Add prefix if not already in URL
                if (prefix.length() > 0 && !url.startsWith(prefix)) {
                    url = prefix + url;
                }
                
                Serial.print(F("[NFC] NDEF URL extracted: "));
                Serial.println(url);
                return url;
            }
        }
    }
    
    Serial.println(F("[NFC] No URI record found in NDEF message"));
    return "";
}

String readAllSectorData() {
    MFRC522::MIFARE_Key key;
    for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;
    
    StaticJsonDocument<2048> doc;
    JsonArray sectors = doc.createNestedArray("sectors");
    
    byte buffer[18];
    
    // Read all sectors (0 to 15 for 1K card)
    for (byte sector = 0; sector < SECTOR_COUNT; sector++) {
        JsonObject sectorObj = sectors.createNestedObject();
        sectorObj["sector"] = sector;
        
        JsonArray blocks = sectorObj.createNestedArray("blocks");
        
        // Each sector has 4 blocks (0-3), except sector 15 which may vary
        byte blocksInSector = (sector < 32) ? 4 : 16;
        byte startBlock = sector * 4;
        
        for (byte block = 0; block < blocksInSector; block++) {
            byte blockAddr = startBlock + block;
            
            // Authenticate
            byte status = mfrc522.PCD_Authenticate(MFRC522::PICC_CMD_MF_AUTH_KEY_A, blockAddr, &key, &(mfrc522.uid));
            if (status != MFRC522::STATUS_OK) {
                // Skip unreadable blocks
                continue;
            }
            
            // Read block
            byte size = sizeof(buffer);
            status = mfrc522.MIFARE_Read(blockAddr, buffer, &size);
            
            if (status == MFRC522::STATUS_OK) {
                JsonObject blockObj = blocks.createNestedObject();
                blockObj["block"] = blockAddr;
                
                // Convert to hex string
                String data = "";
                for (byte i = 0; i < 16; i++) {
                    if (buffer[i] < 0x10) data += "0";
                    data += String(buffer[i], HEX);
                    if (i < 15) data += " ";
                }
                blockObj["data"] = data;
                
                // Try to convert to ASCII if printable
                String ascii = "";
                for (byte i = 0; i < 16; i++) {
                    char c = buffer[i];
                    if (c >= 32 && c < 127) ascii += c;
                    else ascii += ".";
                }
                blockObj["ascii"] = ascii;
            }
            
            mfrc522.PICC_HaltA();
            mfrc522.PCD_StopCrypto1();
            yield(); // Prevent watchdog reset
        }
    }
    
    String result;
    serializeJson(doc, result);
    return result;
}

void waitForTagRemoval() {
    Serial.println(F("[NFC] Waiting for tag removal..."));
    displayShowMessage("Complete", "Remove tag now", 0);
    
    unsigned long waitStart = millis();
    while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
        yield();
        delay(100);
    }
}

