hebertreis/taptosow/esp8266-arduino/src/main.cpp
void nfcInit() {
    Serial.println(F("\n[NFC] Initializing RC522 (Software SPI)..."));

    // Initialize RC522 with Software SPI
    // SPI.begin() not needed - using bit-banged SPI on custom pins
    mfrc522.PCD_Init();
    delay(500); // Wait longer for RC522 to be ready with Software SPI

    // Set maximum antenna gain
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);

    // Check firmware version
    byte version = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    Serial.print(F("[NFC] RC522 Firmware Version: 0x"));
    Serial.println(version, HEX);

    // Store firmware version globally
    nfcFirmwareVersion = version;

    if (version == 0x00 || version == 0xFF) {
        Serial.println(F("[NFC] WARNING: RC522 not found or not responding!"));
        Serial.println(F("[NFC] Check wiring: SS=D8, RST=D3, SCK=D1, MISO=D2, MOSI=D7"));
        isNfcConnected = false;
        displayShowMessage("NFC Error", "RC522 not found", 3000);
    } else {
        Serial.println(F("[NFC] RC522 initialized successfully"));
        isNfcConnected = true;
        // Test tag detection
        Serial.println(F("[NFC] Testing tag detection..."));
        byte bufferATQA[2];
        byte bufferSize = sizeof(bufferATQA);
        MFRC522::StatusCode status = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);
        if (status == MFRC522::STATUS_OK) {
            Serial.println(F("[NFC] Tag detected during test!"));
        } else {
            Serial.print(F("[NFC] No tag present (status: "));
            Serial.println(mfrc522.GetStatusCodeName(status));
            Serial.println(F(") - This is normal if no tag is near"));
        }

        displayShowMessage("NFC OK", "Ready to write", 1000);
    }
}

// ============================================================================
// SYSTEM FUNCTIONS
// ============================================================================

void systemInit() {
    // Initialize serial
    Serial.begin(115200);
    delay(1000);

    Serial.println(F("\n========================================"));
    Serial.println(F("   ONETAPGO NFC WRITER v" DEVICE_VERSION));
    Serial.println(F("        BY CRE8 TECNOLOGIA"));
    Serial.println(F("========================================"));
    Serial.print(F("[SYS] Free heap: "));
    Serial.println(ESP.getFreeHeap());
    Serial.print(F("[SYS] Chip ID: "));
    Serial.println(ESP.getChipId());

    // Initialize display
    displayInit();
    displayShowState(STATE_CONFIG_MODE);

    // Initialize WiFi
    wifiInit();
    displayShowState(STATE_IDLE);

    // Initialize MQTT
    mqttInit();

    // Initialize NFC (SPI - independent from I2C display)
    nfcInit();

    // Update display with NFC status
    displayShowState(STATE_IDLE);

    // Configure button pin (optional)
    pinMode(BUTTON_PIN, INPUT_PULLUP);

    Serial.println(F("\n[SYS] Initialization complete"));
    Serial.print(F("[SYS] Free heap after init: "));
    Serial.println(ESP.getFreeHeap());
    
    // Log initial mode
    Serial.print(F("[SYS] Initial mode: "));
    Serial.println(readMode ? F("Reader (auto-transmitting)") : F("Standby"));
    if (hasPendingWriteCommand) {
        Serial.println(F("[SYS] Pending write command: YES"));
    }
}

void systemLoop() {
    // Check WiFi connection
    wifiCheckConnection();

    // Handle MQTT
    mqttLoop();

    // Update display periodically to show current mode and connection status
    static unsigned long lastDisplayUpdate = 0;
    static DeviceState lastKnownState = STATE_IDLE;
    static bool lastKnownWifi = false;
    static bool lastKnownMqtt = false;
    static bool lastKnownNfc = false;
    static bool lastKnownReadMode = readMode;
    static bool lastKnownHasPendingCommand = hasPendingWriteCommand;
    
    // Update display every 1 second or when state changes
    bool stateChanged = (currentState != lastKnownState ||
        isWifiConnected != lastKnownWifi ||
        isMqttConnected != lastKnownMqtt ||
        isNfcConnected != lastKnownNfc ||
        readMode != lastKnownReadMode ||
        hasPendingWriteCommand != lastKnownHasPendingCommand);
    
    if (millis() - lastDisplayUpdate > 1000 || stateChanged) {
        lastDisplayUpdate = millis();
        lastKnownState = currentState;
        lastKnownWifi = isWifiConnected;
        lastKnownMqtt = isMqttConnected;
        lastKnownNfc = isNfcConnected;
        lastKnownReadMode = readMode;
        lastKnownHasPendingCommand = hasPendingWriteCommand;
        
        Serial.print(F("[DISPLAY] Updating - Mode: "));
        Serial.print(hasPendingWriteCommand ? F("Writer") : (readMode ? F("Reader") : F("Standby")));
        Serial.print(F(", WiFi: "));
        Serial.print(isWifiConnected ? F("OK") : F("NO"));
        Serial.print(F(", MQTT: "));
        Serial.print(isMqttConnected ? F("OK") : F("NO"));
        Serial.print(F(", NFC: "));
        Serial.println(isNfcConnected ? F("OK") : F("NO"));
        
        displayShowState(currentState);
    }

    // NFC polling with cooldown to avoid RC522 command flooding
    // NFC_POLL_INTERVAL = 50ms - prevents 'RequestA failed: Timeout' errors
    static unsigned long lastNfcPoll = 0;
    if (currentState == STATE_WAITING_TAG || currentState == STATE_IDLE || currentState == STATE_READ_MODE) {
        if (millis() - lastNfcPoll >= NFC_POLL_INTERVAL) {
            lastNfcPoll = millis();
            // Request tag (REQI DL) - standard MIFARE detection
            byte bufferATQA[2];
            byte bufferSize = sizeof(bufferATQA);
            byte status = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);

            if (status == MFRC522::STATUS_OK) {
                // Tag detected - small delay before processing
                delay(10);
                processNfcTag();
            }
        }
    }

    // Check button (optional manual trigger)
    static unsigned long lastButtonCheck = 0;
    if (millis() - lastButtonCheck > 100) {
        lastButtonCheck = millis();
        if (digitalRead(BUTTON_PIN) == LOW) {
            delay(50); // Debounce
            if (digitalRead(BUTTON_PIN) == LOW) {
                Serial.println(F("[BTN] Button pressed"));
                // Could trigger manual write or other action
            }
        }
    }

    // Watchdog feed
    yield();
}

// ============================================================================
// ARDUINO SETUP & LOOP
// ============================================================================

void setup() {
    systemInit();
    displayShowState(STATE_IDLE);
}

void loop() {
    systemLoop();
}
